# Задание 4:
# Напишите программу, которая запрашивает у пользователя шесть вещественных чисел.
# На экран выводит минимальное и максимальное из них, округленные до двух знаков после запятой.
# Выполните задание без использования встроенных функций min() и max().
####################################################################
a = float(input('enter number '))
'''создание первого числа'''

min = a
max = a
'''присвоение значения первого числа максимальному и минимальному значению'''

for i in range(1):
    '''цикл для создания чисел и проверки их на максимальность или минимальность'''

    a = float(input('enter number '))
    '''создание нового числа'''

    if a > max:
        '''проверка на максимальность'''
        max = a

    if a < max and a < min:
        '''проверка на минимальность'''
        min = a

print('\n','min is: ',round(min,2),'\n','max is: ',round(max,2))
'''вывод миниального и максимального чисел'''


b = float(input('enter number '))
'''создание первого числа'''

min = b
max = b
'''присвоение значения первого числа максимальному и минимальному значению'''

for i in range(1):
    '''цикл для создания чисел и проверки их на максимальность или минимальность'''

    b = float(input('enter number '))
    '''создание нового числа'''

    if b > max:
        '''проверка на максимальность'''
        max = b

    if b < max and b < min:
        '''проверка на минимальность'''
        min = b

print('\n','min is: ',round(min,2),'\n','max is: ',round(max,2))
'''вывод миниального и максимального чисел'''


c = float(input('enter number '))
'''создание первого числа'''

min = c
max = c
'''присвоение значения первого числа максимальному и минимальному значению'''

for i in range(1):
    '''цикл для создания чисел и проверки их на максимальность или минимальность'''

    c = float(input('enter number '))
    '''создание нового числа'''

    if c > max:
        '''проверка на максимальность'''
        max = c

    if c < max and c < min:
        '''проверка на минимальность'''
        min = c

print('\n','min is: ',round(min,2),'\n','max is: ',round(max,2))
'''вывод миниального и максимального чисел'''


d = float(input('enter number '))
'''создание первого числа'''

min = d
max = d
'''присвоение значения первого числа максимальному и минимальному значению'''

for i in range(1):
    '''цикл для создания чисел и проверки их на максимальность или минимальность'''

    d = float(input('enter number '))
    '''создание нового числа'''

    if d > max:
        '''проверка на максимальность'''
        max = d

    if d < max and d < min:
        '''проверка на минимальность'''
        min = d

print('\n','min is: ',round(min,2),'\n','max is: ',round(max,2))
'''вывод миниального и максимального чисел'''


f = float(input('enter number '))
'''создание первого числа'''

min = f
max = f
'''присвоение значения первого числа максимальному и минимальному значению'''

for i in range(1):
    '''цикл для создания чисел и проверки их на максимальность или минимальность'''

    f = float(input('enter number '))
    '''создание нового числа'''

    if f > max:
        '''проверка на максимальность'''
        max = f

    if f < max and f < min:
        '''проверка на минимальность'''
        min = f

print('\n','min is: ',round(min,2),'\n','max is: ',round(max,2))
'''вывод миниального и максимального чисел'''



g = float(input('enter number '))
'''создание первого числа'''

min = g
max = g
'''присвоение значения первого числа максимальному и минимальному значению'''

for i in range(1):
    '''цикл для создания чисел и проверки их на максимальность или минимальность'''

    g = float(input('enter number '))
    '''создание нового числа'''

    if g > max:
        '''проверка на максимальность'''
        max = g

    if g < max and g < min:
        '''проверка на минимальность'''
        min = g

print('\n','min is: ',round(min,2),'\n','max is: ',round(max,2))
'''вывод миниального и максимального чисел'''


