
# Задание 3:
# Напишите программу, которая измеряет длину введенной строки.
stroka = ['maksatStalkerskantel']
x = len(stroka)
# Если строка длиннее десяти символов, то выносится предупреждение.
for prohod in stroka:
    if x > 10:
        print('Предупреждение')

# Если короче, то к строке добавляется столько символов *, чтобы ее длина составляла десять символов,
# после чего новая строка должна выводиться на экран.
###################################################################
